espressif/esp-idf/components/soc/esp32c5/register/soc/pcr_reg.h
/**
 * SPDX-FileCopyrightText: 2024-2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** PCR_UART0_CONF_REG register
 *  UART0 configuration register
 */
#define PCR_UART0_CONF_REG (DR_REG_PCR_BASE + 0x0)
/** PCR_UART0_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable uart0 apb clock
 */
#define PCR_UART0_CLK_EN    (BIT(0))
#define PCR_UART0_CLK_EN_M  (PCR_UART0_CLK_EN_V << PCR_UART0_CLK_EN_S)
#define PCR_UART0_CLK_EN_V  0x00000001U
#define PCR_UART0_CLK_EN_S  0
/** PCR_UART0_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset uart0 module
 */
#define PCR_UART0_RST_EN    (BIT(1))
#define PCR_UART0_RST_EN_M  (PCR_UART0_RST_EN_V << PCR_UART0_RST_EN_S)
#define PCR_UART0_RST_EN_V  0x00000001U
#define PCR_UART0_RST_EN_S  1
/** PCR_UART0_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset uart0 module
 */
#define PCR_UART0_READY    (BIT(2))
#define PCR_UART0_READY_M  (PCR_UART0_READY_V << PCR_UART0_READY_S)
#define PCR_UART0_READY_V  0x00000001U
#define PCR_UART0_READY_S  2

/** PCR_UART0_SCLK_CONF_REG register
 *  UART0_SCLK configuration register
 */
#define PCR_UART0_SCLK_CONF_REG (DR_REG_PCR_BASE + 0x4)
/** PCR_UART0_SCLK_DIV_A : R/W; bitpos: [5:0]; default: 0;
 *  The  denominator of the frequency divider factor of the uart0 function clock.
 */
#define PCR_UART0_SCLK_DIV_A    0x0000003FU
#define PCR_UART0_SCLK_DIV_A_M  (PCR_UART0_SCLK_DIV_A_V << PCR_UART0_SCLK_DIV_A_S)
#define PCR_UART0_SCLK_DIV_A_V  0x0000003FU
#define PCR_UART0_SCLK_DIV_A_S  0
/** PCR_UART0_SCLK_DIV_B : R/W; bitpos: [11:6]; default: 0;
 *  The numerator of the frequency divider factor of the uart0 function clock.
 */
#define PCR_UART0_SCLK_DIV_B    0x0000003FU
#define PCR_UART0_SCLK_DIV_B_M  (PCR_UART0_SCLK_DIV_B_V << PCR_UART0_SCLK_DIV_B_S)
#define PCR_UART0_SCLK_DIV_B_V  0x0000003FU
#define PCR_UART0_SCLK_DIV_B_S  6
/** PCR_UART0_SCLK_DIV_NUM : R/W; bitpos: [19:12]; default: 0;
 *  The integral part of the frequency divider factor of the uart0 function clock.
 */
#define PCR_UART0_SCLK_DIV_NUM    0x000000FFU
#define PCR_UART0_SCLK_DIV_NUM_M  (PCR_UART0_SCLK_DIV_NUM_V << PCR_UART0_SCLK_DIV_NUM_S)
#define PCR_UART0_SCLK_DIV_NUM_V  0x000000FFU
#define PCR_UART0_SCLK_DIV_NUM_S  12
/** PCR_UART0_SCLK_SEL : R/W; bitpos: [21:20]; default: 0;
 *  Configures the clock source of UART0.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 *  2: PLL_F80M_CLK
 */
#define PCR_UART0_SCLK_SEL    0x00000003U
#define PCR_UART0_SCLK_SEL_M  (PCR_UART0_SCLK_SEL_V << PCR_UART0_SCLK_SEL_S)
#define PCR_UART0_SCLK_SEL_V  0x00000003U
#define PCR_UART0_SCLK_SEL_S  20
/** PCR_UART0_SCLK_EN : R/W; bitpos: [22]; default: 1;
 *  Set 1 to enable uart0 function clock
 */
#define PCR_UART0_SCLK_EN    (BIT(22))
#define PCR_UART0_SCLK_EN_M  (PCR_UART0_SCLK_EN_V << PCR_UART0_SCLK_EN_S)
#define PCR_UART0_SCLK_EN_V  0x00000001U
#define PCR_UART0_SCLK_EN_S  22

/** PCR_UART0_PD_CTRL_REG register
 *  UART0 power control register
 */
#define PCR_UART0_PD_CTRL_REG (DR_REG_PCR_BASE + 0x8)
/** PCR_UART0_MEM_FORCE_PU : R/W; bitpos: [1]; default: 1;
 *  Set this bit to force power up UART0 memory.
 */
#define PCR_UART0_MEM_FORCE_PU    (BIT(1))
#define PCR_UART0_MEM_FORCE_PU_M  (PCR_UART0_MEM_FORCE_PU_V << PCR_UART0_MEM_FORCE_PU_S)
#define PCR_UART0_MEM_FORCE_PU_V  0x00000001U
#define PCR_UART0_MEM_FORCE_PU_S  1
/** PCR_UART0_MEM_FORCE_PD : R/W; bitpos: [2]; default: 0;
 *  Set this bit to force power down UART0 memory.
 */
#define PCR_UART0_MEM_FORCE_PD    (BIT(2))
#define PCR_UART0_MEM_FORCE_PD_M  (PCR_UART0_MEM_FORCE_PD_V << PCR_UART0_MEM_FORCE_PD_S)
#define PCR_UART0_MEM_FORCE_PD_V  0x00000001U
#define PCR_UART0_MEM_FORCE_PD_S  2

/** PCR_UART1_CONF_REG register
 *  UART1 configuration register
 */
#define PCR_UART1_CONF_REG (DR_REG_PCR_BASE + 0xc)
/** PCR_UART1_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable uart1 apb clock
 */
#define PCR_UART1_CLK_EN    (BIT(0))
#define PCR_UART1_CLK_EN_M  (PCR_UART1_CLK_EN_V << PCR_UART1_CLK_EN_S)
#define PCR_UART1_CLK_EN_V  0x00000001U
#define PCR_UART1_CLK_EN_S  0
/** PCR_UART1_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset uart1 module
 */
#define PCR_UART1_RST_EN    (BIT(1))
#define PCR_UART1_RST_EN_M  (PCR_UART1_RST_EN_V << PCR_UART1_RST_EN_S)
#define PCR_UART1_RST_EN_V  0x00000001U
#define PCR_UART1_RST_EN_S  1
/** PCR_UART1_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset uart1 module
 */
#define PCR_UART1_READY    (BIT(2))
#define PCR_UART1_READY_M  (PCR_UART1_READY_V << PCR_UART1_READY_S)
#define PCR_UART1_READY_V  0x00000001U
#define PCR_UART1_READY_S  2

/** PCR_UART1_SCLK_CONF_REG register
 *  UART1_SCLK configuration register
 */
#define PCR_UART1_SCLK_CONF_REG (DR_REG_PCR_BASE + 0x10)
/** PCR_UART1_SCLK_DIV_A : R/W; bitpos: [5:0]; default: 0;
 *  The  denominator of the frequency divider factor of the uart1 function clock.
 */
#define PCR_UART1_SCLK_DIV_A    0x0000003FU
#define PCR_UART1_SCLK_DIV_A_M  (PCR_UART1_SCLK_DIV_A_V << PCR_UART1_SCLK_DIV_A_S)
#define PCR_UART1_SCLK_DIV_A_V  0x0000003FU
#define PCR_UART1_SCLK_DIV_A_S  0
/** PCR_UART1_SCLK_DIV_B : R/W; bitpos: [11:6]; default: 0;
 *  The numerator of the frequency divider factor of the uart1 function clock.
 */
#define PCR_UART1_SCLK_DIV_B    0x0000003FU
#define PCR_UART1_SCLK_DIV_B_M  (PCR_UART1_SCLK_DIV_B_V << PCR_UART1_SCLK_DIV_B_S)
#define PCR_UART1_SCLK_DIV_B_V  0x0000003FU
#define PCR_UART1_SCLK_DIV_B_S  6
/** PCR_UART1_SCLK_DIV_NUM : R/W; bitpos: [19:12]; default: 0;
 *  The integral part of the frequency divider factor of the uart1 function clock.
 */
#define PCR_UART1_SCLK_DIV_NUM    0x000000FFU
#define PCR_UART1_SCLK_DIV_NUM_M  (PCR_UART1_SCLK_DIV_NUM_V << PCR_UART1_SCLK_DIV_NUM_S)
#define PCR_UART1_SCLK_DIV_NUM_V  0x000000FFU
#define PCR_UART1_SCLK_DIV_NUM_S  12
/** PCR_UART1_SCLK_SEL : R/W; bitpos: [21:20]; default: 0;
 *  Configures the clock source of UART1.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 *  2: PLL_F80M_CLK
 */
#define PCR_UART1_SCLK_SEL    0x00000003U
#define PCR_UART1_SCLK_SEL_M  (PCR_UART1_SCLK_SEL_V << PCR_UART1_SCLK_SEL_S)
#define PCR_UART1_SCLK_SEL_V  0x00000003U
#define PCR_UART1_SCLK_SEL_S  20
/** PCR_UART1_SCLK_EN : R/W; bitpos: [22]; default: 1;
 *  Set 1 to enable uart0 function clock
 */
#define PCR_UART1_SCLK_EN    (BIT(22))
#define PCR_UART1_SCLK_EN_M  (PCR_UART1_SCLK_EN_V << PCR_UART1_SCLK_EN_S)
#define PCR_UART1_SCLK_EN_V  0x00000001U
#define PCR_UART1_SCLK_EN_S  22

/** PCR_UART1_PD_CTRL_REG register
 *  UART1 power control register
 */
#define PCR_UART1_PD_CTRL_REG (DR_REG_PCR_BASE + 0x14)
/** PCR_UART1_MEM_FORCE_PU : R/W; bitpos: [1]; default: 1;
 *  Set this bit to force power up UART1 memory.
 */
#define PCR_UART1_MEM_FORCE_PU    (BIT(1))
#define PCR_UART1_MEM_FORCE_PU_M  (PCR_UART1_MEM_FORCE_PU_V << PCR_UART1_MEM_FORCE_PU_S)
#define PCR_UART1_MEM_FORCE_PU_V  0x00000001U
#define PCR_UART1_MEM_FORCE_PU_S  1
/** PCR_UART1_MEM_FORCE_PD : R/W; bitpos: [2]; default: 0;
 *  Set this bit to force power down UART1 memory.
 */
#define PCR_UART1_MEM_FORCE_PD    (BIT(2))
#define PCR_UART1_MEM_FORCE_PD_M  (PCR_UART1_MEM_FORCE_PD_V << PCR_UART1_MEM_FORCE_PD_S)
#define PCR_UART1_MEM_FORCE_PD_V  0x00000001U
#define PCR_UART1_MEM_FORCE_PD_S  2

/** PCR_MSPI_CONF_REG register
 *  MSPI configuration register
 */
#define PCR_MSPI_CONF_REG (DR_REG_PCR_BASE + 0x18)
/** PCR_MSPI_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable mspi apb clock and mspi pll clock
 */
#define PCR_MSPI_CLK_EN    (BIT(0))
#define PCR_MSPI_CLK_EN_M  (PCR_MSPI_CLK_EN_V << PCR_MSPI_CLK_EN_S)
#define PCR_MSPI_CLK_EN_V  0x00000001U
#define PCR_MSPI_CLK_EN_S  0
/** PCR_MSPI_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset mspi module
 */
#define PCR_MSPI_RST_EN    (BIT(1))
#define PCR_MSPI_RST_EN_M  (PCR_MSPI_RST_EN_V << PCR_MSPI_RST_EN_S)
#define PCR_MSPI_RST_EN_V  0x00000001U
#define PCR_MSPI_RST_EN_S  1
/** PCR_MSPI_PLL_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  Set 1 to enable mspi pll clock
 */
#define PCR_MSPI_PLL_CLK_EN    (BIT(2))
#define PCR_MSPI_PLL_CLK_EN_M  (PCR_MSPI_PLL_CLK_EN_V << PCR_MSPI_PLL_CLK_EN_S)
#define PCR_MSPI_PLL_CLK_EN_V  0x00000001U
#define PCR_MSPI_PLL_CLK_EN_S  2
/** PCR_MSPI_READY : RO; bitpos: [3]; default: 1;
 *  Query this field after reset mspi module
 */
#define PCR_MSPI_READY    (BIT(3))
#define PCR_MSPI_READY_M  (PCR_MSPI_READY_V << PCR_MSPI_READY_S)
#define PCR_MSPI_READY_V  0x00000001U
#define PCR_MSPI_READY_S  3

/** PCR_MSPI_CLK_CONF_REG register
 *  MSPI_CLK configuration register
 */
#define PCR_MSPI_CLK_CONF_REG (DR_REG_PCR_BASE + 0x1c)
/** PCR_MSPI_FAST_DIV_NUM : R/W; bitpos: [7:0]; default: 0;
 *  Set as one within (0,1,2) to generate div1(default)/div2/div4 of low-speed
 *  clock-source to drive clk_mspi_fast. Only available when the clck-source is a
 *  low-speed clock-source such as XTAL/FOSC.
 */
#define PCR_MSPI_FAST_DIV_NUM    0x000000FFU
#define PCR_MSPI_FAST_DIV_NUM_M  (PCR_MSPI_FAST_DIV_NUM_V << PCR_MSPI_FAST_DIV_NUM_S)
#define PCR_MSPI_FAST_DIV_NUM_V  0x000000FFU
#define PCR_MSPI_FAST_DIV_NUM_S  0
/** PCR_MSPI_FUNC_CLK_SEL : R/W; bitpos: [9:8]; default: 0;
 *  Configures the clock source for MSPI.
 *  0(default): XTAL_CLK
 *  1 RC_FAST_CLK
 *  2: PLL_F480M_CLK
 */
#define PCR_MSPI_FUNC_CLK_SEL    0x00000003U
#define PCR_MSPI_FUNC_CLK_SEL_M  (PCR_MSPI_FUNC_CLK_SEL_V << PCR_MSPI_FUNC_CLK_SEL_S)
#define PCR_MSPI_FUNC_CLK_SEL_V  0x00000003U
#define PCR_MSPI_FUNC_CLK_SEL_S  8
/** PCR_MSPI_FUNC_CLK_EN : R/W; bitpos: [10]; default: 1;
 *  Set 1 to enable mspi func clock
 */
#define PCR_MSPI_FUNC_CLK_EN    (BIT(10))
#define PCR_MSPI_FUNC_CLK_EN_M  (PCR_MSPI_FUNC_CLK_EN_V << PCR_MSPI_FUNC_CLK_EN_S)
#define PCR_MSPI_FUNC_CLK_EN_V  0x00000001U
#define PCR_MSPI_FUNC_CLK_EN_S  10
/** PCR_MSPI_AXI_RST_EN : R/W; bitpos: [11]; default: 0;
 *  Set 1 to reset axi_clock domain of mspi module
 */
#define PCR_MSPI_AXI_RST_EN    (BIT(11))
#define PCR_MSPI_AXI_RST_EN_M  (PCR_MSPI_AXI_RST_EN_V << PCR_MSPI_AXI_RST_EN_S)
#define PCR_MSPI_AXI_RST_EN_V  0x00000001U
#define PCR_MSPI_AXI_RST_EN_S  11

/** PCR_I2C_CONF_REG register
 *  I2C configuration register
 */
#define PCR_I2C_CONF_REG (DR_REG_PCR_BASE + 0x20)
/** PCR_I2C_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable i2c apb clock
 */
#define PCR_I2C_CLK_EN    (BIT(0))
#define PCR_I2C_CLK_EN_M  (PCR_I2C_CLK_EN_V << PCR_I2C_CLK_EN_S)
#define PCR_I2C_CLK_EN_V  0x00000001U
#define PCR_I2C_CLK_EN_S  0
/** PCR_I2C_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset i2c module
 */
#define PCR_I2C_RST_EN    (BIT(1))
#define PCR_I2C_RST_EN_M  (PCR_I2C_RST_EN_V << PCR_I2C_RST_EN_S)
#define PCR_I2C_RST_EN_V  0x00000001U
#define PCR_I2C_RST_EN_S  1

