espressif/esp-idf/components/soc/esp32c5/register/soc/pcr_reg.h
/** PCR_I2C_SCLK_CONF_REG register
 *  I2C_SCLK configuration register
 */
#define PCR_I2C_SCLK_CONF_REG (DR_REG_PCR_BASE + 0x24)
/** PCR_I2C_SCLK_DIV_A : R/W; bitpos: [5:0]; default: 0;
 *  The  denominator of the frequency divider factor of the i2c function clock.
 */
#define PCR_I2C_SCLK_DIV_A    0x0000003FU
#define PCR_I2C_SCLK_DIV_A_M  (PCR_I2C_SCLK_DIV_A_V << PCR_I2C_SCLK_DIV_A_S)
#define PCR_I2C_SCLK_DIV_A_V  0x0000003FU
#define PCR_I2C_SCLK_DIV_A_S  0
/** PCR_I2C_SCLK_DIV_B : R/W; bitpos: [11:6]; default: 0;
 *  The numerator of the frequency divider factor of the i2c function clock.
 */
#define PCR_I2C_SCLK_DIV_B    0x0000003FU
#define PCR_I2C_SCLK_DIV_B_M  (PCR_I2C_SCLK_DIV_B_V << PCR_I2C_SCLK_DIV_B_S)
#define PCR_I2C_SCLK_DIV_B_V  0x0000003FU
#define PCR_I2C_SCLK_DIV_B_S  6
/** PCR_I2C_SCLK_DIV_NUM : R/W; bitpos: [19:12]; default: 0;
 *  The integral part of the frequency divider factor of the i2c function clock.
 */
#define PCR_I2C_SCLK_DIV_NUM    0x000000FFU
#define PCR_I2C_SCLK_DIV_NUM_M  (PCR_I2C_SCLK_DIV_NUM_V << PCR_I2C_SCLK_DIV_NUM_S)
#define PCR_I2C_SCLK_DIV_NUM_V  0x000000FFU
#define PCR_I2C_SCLK_DIV_NUM_S  12
/** PCR_I2C_SCLK_SEL : R/W; bitpos: [20]; default: 0;
 *  Configures the clock source of I2C.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 */
#define PCR_I2C_SCLK_SEL    (BIT(20))
#define PCR_I2C_SCLK_SEL_M  (PCR_I2C_SCLK_SEL_V << PCR_I2C_SCLK_SEL_S)
#define PCR_I2C_SCLK_SEL_V  0x00000001U
#define PCR_I2C_SCLK_SEL_S  20
/** PCR_I2C_SCLK_EN : R/W; bitpos: [22]; default: 0;
 *  Set 1 to enable i2c function clock
 */
#define PCR_I2C_SCLK_EN    (BIT(22))
#define PCR_I2C_SCLK_EN_M  (PCR_I2C_SCLK_EN_V << PCR_I2C_SCLK_EN_S)
#define PCR_I2C_SCLK_EN_V  0x00000001U
#define PCR_I2C_SCLK_EN_S  22

/** PCR_TWAI0_CONF_REG register
 *  TWAI0 configuration register
 */
#define PCR_TWAI0_CONF_REG (DR_REG_PCR_BASE + 0x28)
/** PCR_TWAI0_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable twai0 apb clock
 */
#define PCR_TWAI0_CLK_EN    (BIT(0))
#define PCR_TWAI0_CLK_EN_M  (PCR_TWAI0_CLK_EN_V << PCR_TWAI0_CLK_EN_S)
#define PCR_TWAI0_CLK_EN_V  0x00000001U
#define PCR_TWAI0_CLK_EN_S  0
/** PCR_TWAI0_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset twai0 module
 */
#define PCR_TWAI0_RST_EN    (BIT(1))
#define PCR_TWAI0_RST_EN_M  (PCR_TWAI0_RST_EN_V << PCR_TWAI0_RST_EN_S)
#define PCR_TWAI0_RST_EN_V  0x00000001U
#define PCR_TWAI0_RST_EN_S  1
/** PCR_TWAI0_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset twai0 module
 */
#define PCR_TWAI0_READY    (BIT(2))
#define PCR_TWAI0_READY_M  (PCR_TWAI0_READY_V << PCR_TWAI0_READY_S)
#define PCR_TWAI0_READY_V  0x00000001U
#define PCR_TWAI0_READY_S  2

/** PCR_TWAI0_FUNC_CLK_CONF_REG register
 *  TWAI0_FUNC_CLK configuration register
 */
#define PCR_TWAI0_FUNC_CLK_CONF_REG (DR_REG_PCR_BASE + 0x2c)
/** PCR_TWAI0_FUNC_CLK_SEL : R/W; bitpos: [20]; default: 0;
 *  Configures the clock source of TWAI0.
 *  0 (default): XTAL_CLK
 *  1: PLL_F80M_CLK
 */
#define PCR_TWAI0_FUNC_CLK_SEL    (BIT(20))
#define PCR_TWAI0_FUNC_CLK_SEL_M  (PCR_TWAI0_FUNC_CLK_SEL_V << PCR_TWAI0_FUNC_CLK_SEL_S)
#define PCR_TWAI0_FUNC_CLK_SEL_V  0x00000001U
#define PCR_TWAI0_FUNC_CLK_SEL_S  20
/** PCR_TWAI0_FUNC_CLK_EN : R/W; bitpos: [22]; default: 0;
 *  Set 1 to enable twai0 function clock
 */
#define PCR_TWAI0_FUNC_CLK_EN    (BIT(22))
#define PCR_TWAI0_FUNC_CLK_EN_M  (PCR_TWAI0_FUNC_CLK_EN_V << PCR_TWAI0_FUNC_CLK_EN_S)
#define PCR_TWAI0_FUNC_CLK_EN_V  0x00000001U
#define PCR_TWAI0_FUNC_CLK_EN_S  22

/** PCR_TWAI1_CONF_REG register
 *  TWAI1 configuration register
 */
#define PCR_TWAI1_CONF_REG (DR_REG_PCR_BASE + 0x30)
/** PCR_TWAI1_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable twai1 apb clock
 */
#define PCR_TWAI1_CLK_EN    (BIT(0))
#define PCR_TWAI1_CLK_EN_M  (PCR_TWAI1_CLK_EN_V << PCR_TWAI1_CLK_EN_S)
#define PCR_TWAI1_CLK_EN_V  0x00000001U
#define PCR_TWAI1_CLK_EN_S  0
/** PCR_TWAI1_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset twai1 module
 */
#define PCR_TWAI1_RST_EN    (BIT(1))
#define PCR_TWAI1_RST_EN_M  (PCR_TWAI1_RST_EN_V << PCR_TWAI1_RST_EN_S)
#define PCR_TWAI1_RST_EN_V  0x00000001U
#define PCR_TWAI1_RST_EN_S  1
/** PCR_TWAI1_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset twai1 module
 */
#define PCR_TWAI1_READY    (BIT(2))
#define PCR_TWAI1_READY_M  (PCR_TWAI1_READY_V << PCR_TWAI1_READY_S)
#define PCR_TWAI1_READY_V  0x00000001U
#define PCR_TWAI1_READY_S  2

/** PCR_TWAI1_FUNC_CLK_CONF_REG register
 *  TWAI1_FUNC_CLK configuration register
 */
#define PCR_TWAI1_FUNC_CLK_CONF_REG (DR_REG_PCR_BASE + 0x34)
/** PCR_TWAI1_FUNC_CLK_SEL : R/W; bitpos: [20]; default: 0;
 *  Configures the clock source of TWAI1.
 *  0 (default): XTAL_CLK
 *  1: PLL_F80M_CLK
 */
#define PCR_TWAI1_FUNC_CLK_SEL    (BIT(20))
#define PCR_TWAI1_FUNC_CLK_SEL_M  (PCR_TWAI1_FUNC_CLK_SEL_V << PCR_TWAI1_FUNC_CLK_SEL_S)
#define PCR_TWAI1_FUNC_CLK_SEL_V  0x00000001U
#define PCR_TWAI1_FUNC_CLK_SEL_S  20
/** PCR_TWAI1_FUNC_CLK_EN : R/W; bitpos: [22]; default: 0;
 *  Set 1 to enable twai1 function clock
 */
#define PCR_TWAI1_FUNC_CLK_EN    (BIT(22))
#define PCR_TWAI1_FUNC_CLK_EN_M  (PCR_TWAI1_FUNC_CLK_EN_V << PCR_TWAI1_FUNC_CLK_EN_S)
#define PCR_TWAI1_FUNC_CLK_EN_V  0x00000001U
#define PCR_TWAI1_FUNC_CLK_EN_S  22

/** PCR_UHCI_CONF_REG register
 *  UHCI configuration register
 */
#define PCR_UHCI_CONF_REG (DR_REG_PCR_BASE + 0x38)
/** PCR_UHCI_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable uhci clock
 */
#define PCR_UHCI_CLK_EN    (BIT(0))
#define PCR_UHCI_CLK_EN_M  (PCR_UHCI_CLK_EN_V << PCR_UHCI_CLK_EN_S)
#define PCR_UHCI_CLK_EN_V  0x00000001U
#define PCR_UHCI_CLK_EN_S  0
/** PCR_UHCI_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset uhci module
 */
#define PCR_UHCI_RST_EN    (BIT(1))
#define PCR_UHCI_RST_EN_M  (PCR_UHCI_RST_EN_V << PCR_UHCI_RST_EN_S)
#define PCR_UHCI_RST_EN_V  0x00000001U
#define PCR_UHCI_RST_EN_S  1
/** PCR_UHCI_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset uhci module
 */
#define PCR_UHCI_READY    (BIT(2))
#define PCR_UHCI_READY_M  (PCR_UHCI_READY_V << PCR_UHCI_READY_S)
#define PCR_UHCI_READY_V  0x00000001U
#define PCR_UHCI_READY_S  2

/** PCR_RMT_CONF_REG register
 *  RMT configuration register
 */
#define PCR_RMT_CONF_REG (DR_REG_PCR_BASE + 0x3c)
/** PCR_RMT_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable rmt apb clock
 */
#define PCR_RMT_CLK_EN    (BIT(0))
#define PCR_RMT_CLK_EN_M  (PCR_RMT_CLK_EN_V << PCR_RMT_CLK_EN_S)
#define PCR_RMT_CLK_EN_V  0x00000001U
#define PCR_RMT_CLK_EN_S  0
/** PCR_RMT_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset rmt module
 */
#define PCR_RMT_RST_EN    (BIT(1))
#define PCR_RMT_RST_EN_M  (PCR_RMT_RST_EN_V << PCR_RMT_RST_EN_S)
#define PCR_RMT_RST_EN_V  0x00000001U
#define PCR_RMT_RST_EN_S  1

/** PCR_RMT_SCLK_CONF_REG register
 *  RMT_SCLK configuration register
 */
#define PCR_RMT_SCLK_CONF_REG (DR_REG_PCR_BASE + 0x40)
/** PCR_RMT_SCLK_DIV_A : R/W; bitpos: [5:0]; default: 0;
 *  The  denominator of the frequency divider factor of the rmt function clock.
 */
#define PCR_RMT_SCLK_DIV_A    0x0000003FU
#define PCR_RMT_SCLK_DIV_A_M  (PCR_RMT_SCLK_DIV_A_V << PCR_RMT_SCLK_DIV_A_S)
#define PCR_RMT_SCLK_DIV_A_V  0x0000003FU
#define PCR_RMT_SCLK_DIV_A_S  0
/** PCR_RMT_SCLK_DIV_B : R/W; bitpos: [11:6]; default: 0;
 *  The numerator of the frequency divider factor of the rmt function clock.
 */
#define PCR_RMT_SCLK_DIV_B    0x0000003FU
#define PCR_RMT_SCLK_DIV_B_M  (PCR_RMT_SCLK_DIV_B_V << PCR_RMT_SCLK_DIV_B_S)
#define PCR_RMT_SCLK_DIV_B_V  0x0000003FU
#define PCR_RMT_SCLK_DIV_B_S  6
/** PCR_RMT_SCLK_DIV_NUM : R/W; bitpos: [19:12]; default: 1;
 *  The integral part of the frequency divider factor of the rmt function clock.
 */
#define PCR_RMT_SCLK_DIV_NUM    0x000000FFU
#define PCR_RMT_SCLK_DIV_NUM_M  (PCR_RMT_SCLK_DIV_NUM_V << PCR_RMT_SCLK_DIV_NUM_S)
#define PCR_RMT_SCLK_DIV_NUM_V  0x000000FFU
#define PCR_RMT_SCLK_DIV_NUM_S  12
/** PCR_RMT_SCLK_SEL : R/W; bitpos: [21:20]; default: 1;
 *  Configures the clock source of RMT.
 *  0: XTAL_CLK
 *  1 (default): RC_FAST_CLK
 *  2: PLL_F80M_CLK
 */
#define PCR_RMT_SCLK_SEL    0x00000003U
#define PCR_RMT_SCLK_SEL_M  (PCR_RMT_SCLK_SEL_V << PCR_RMT_SCLK_SEL_S)
#define PCR_RMT_SCLK_SEL_V  0x00000003U
#define PCR_RMT_SCLK_SEL_S  20
/** PCR_RMT_SCLK_EN : R/W; bitpos: [22]; default: 0;
 *  Set 1 to enable rmt function clock
 */
#define PCR_RMT_SCLK_EN    (BIT(22))
#define PCR_RMT_SCLK_EN_M  (PCR_RMT_SCLK_EN_V << PCR_RMT_SCLK_EN_S)
#define PCR_RMT_SCLK_EN_V  0x00000001U
#define PCR_RMT_SCLK_EN_S  22

/** PCR_RMT_PD_CTRL_REG register
 *  RMT power control register
 */
#define PCR_RMT_PD_CTRL_REG (DR_REG_PCR_BASE + 0x44)
/** PCR_RMT_MEM_FORCE_PU : R/W; bitpos: [1]; default: 0;
 *  Set this bit to force power up RMT memory.
 */
#define PCR_RMT_MEM_FORCE_PU    (BIT(1))
#define PCR_RMT_MEM_FORCE_PU_M  (PCR_RMT_MEM_FORCE_PU_V << PCR_RMT_MEM_FORCE_PU_S)
#define PCR_RMT_MEM_FORCE_PU_V  0x00000001U
#define PCR_RMT_MEM_FORCE_PU_S  1
/** PCR_RMT_MEM_FORCE_PD : R/W; bitpos: [2]; default: 1;
 *  Set this bit to force power down RMT memory.
 */
#define PCR_RMT_MEM_FORCE_PD    (BIT(2))
#define PCR_RMT_MEM_FORCE_PD_M  (PCR_RMT_MEM_FORCE_PD_V << PCR_RMT_MEM_FORCE_PD_S)
#define PCR_RMT_MEM_FORCE_PD_V  0x00000001U
#define PCR_RMT_MEM_FORCE_PD_S  2

