espressif/esp-idf/components/soc/esp32c5/register/soc/pcr_reg.h
/** PCR_TIMERGROUP1_WDT_CLK_CONF_REG register
 *  TIMERGROUP1_WDT_CLK configuration register
 */
#define PCR_TIMERGROUP1_WDT_CLK_CONF_REG (DR_REG_PCR_BASE + 0x68)
/** PCR_TG1_WDT_CLK_SEL : R/W; bitpos: [21:20]; default: 0;
 *  Configures the clock source of WDT in Timer Group 1.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 *  2: PLL_F80M_CLK
 */
#define PCR_TG1_WDT_CLK_SEL    0x00000003U
#define PCR_TG1_WDT_CLK_SEL_M  (PCR_TG1_WDT_CLK_SEL_V << PCR_TG1_WDT_CLK_SEL_S)
#define PCR_TG1_WDT_CLK_SEL_V  0x00000003U
#define PCR_TG1_WDT_CLK_SEL_S  20
/** PCR_TG1_WDT_CLK_EN : R/W; bitpos: [22]; default: 1;
 *  Set 1 to enable timer_group0 wdt clock
 */
#define PCR_TG1_WDT_CLK_EN    (BIT(22))
#define PCR_TG1_WDT_CLK_EN_M  (PCR_TG1_WDT_CLK_EN_V << PCR_TG1_WDT_CLK_EN_S)
#define PCR_TG1_WDT_CLK_EN_V  0x00000001U
#define PCR_TG1_WDT_CLK_EN_S  22

/** PCR_SYSTIMER_CONF_REG register
 *  SYSTIMER configuration register
 */
#define PCR_SYSTIMER_CONF_REG (DR_REG_PCR_BASE + 0x6c)
/** PCR_SYSTIMER_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable systimer apb clock
 */
#define PCR_SYSTIMER_CLK_EN    (BIT(0))
#define PCR_SYSTIMER_CLK_EN_M  (PCR_SYSTIMER_CLK_EN_V << PCR_SYSTIMER_CLK_EN_S)
#define PCR_SYSTIMER_CLK_EN_V  0x00000001U
#define PCR_SYSTIMER_CLK_EN_S  0
/** PCR_SYSTIMER_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset systimer module
 */
#define PCR_SYSTIMER_RST_EN    (BIT(1))
#define PCR_SYSTIMER_RST_EN_M  (PCR_SYSTIMER_RST_EN_V << PCR_SYSTIMER_RST_EN_S)
#define PCR_SYSTIMER_RST_EN_V  0x00000001U
#define PCR_SYSTIMER_RST_EN_S  1
/** PCR_SYSTIMER_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset systimer module
 */
#define PCR_SYSTIMER_READY    (BIT(2))
#define PCR_SYSTIMER_READY_M  (PCR_SYSTIMER_READY_V << PCR_SYSTIMER_READY_S)
#define PCR_SYSTIMER_READY_V  0x00000001U
#define PCR_SYSTIMER_READY_S  2

/** PCR_SYSTIMER_FUNC_CLK_CONF_REG register
 *  SYSTIMER_FUNC_CLK configuration register
 */
#define PCR_SYSTIMER_FUNC_CLK_CONF_REG (DR_REG_PCR_BASE + 0x70)
/** PCR_SYSTIMER_FUNC_CLK_SEL : R/W; bitpos: [20]; default: 0;
 *  Configures the clock source of System Timer.
 *  0 (default): XTAL_CLK
 *  1: RC_FAST_CLK
 */
#define PCR_SYSTIMER_FUNC_CLK_SEL    (BIT(20))
#define PCR_SYSTIMER_FUNC_CLK_SEL_M  (PCR_SYSTIMER_FUNC_CLK_SEL_V << PCR_SYSTIMER_FUNC_CLK_SEL_S)
#define PCR_SYSTIMER_FUNC_CLK_SEL_V  0x00000001U
#define PCR_SYSTIMER_FUNC_CLK_SEL_S  20
/** PCR_SYSTIMER_FUNC_CLK_EN : R/W; bitpos: [22]; default: 1;
 *  Set 1 to enable systimer function clock
 */
#define PCR_SYSTIMER_FUNC_CLK_EN    (BIT(22))
#define PCR_SYSTIMER_FUNC_CLK_EN_M  (PCR_SYSTIMER_FUNC_CLK_EN_V << PCR_SYSTIMER_FUNC_CLK_EN_S)
#define PCR_SYSTIMER_FUNC_CLK_EN_V  0x00000001U
#define PCR_SYSTIMER_FUNC_CLK_EN_S  22

/** PCR_I2S_CONF_REG register
 *  I2S configuration register
 */
#define PCR_I2S_CONF_REG (DR_REG_PCR_BASE + 0x74)
/** PCR_I2S_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable i2s apb clock
 */
#define PCR_I2S_CLK_EN    (BIT(0))
#define PCR_I2S_CLK_EN_M  (PCR_I2S_CLK_EN_V << PCR_I2S_CLK_EN_S)
#define PCR_I2S_CLK_EN_V  0x00000001U
#define PCR_I2S_CLK_EN_S  0
/** PCR_I2S_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset i2s module
 */
#define PCR_I2S_RST_EN    (BIT(1))
#define PCR_I2S_RST_EN_M  (PCR_I2S_RST_EN_V << PCR_I2S_RST_EN_S)
#define PCR_I2S_RST_EN_V  0x00000001U
#define PCR_I2S_RST_EN_S  1
/** PCR_I2S_RX_READY : RO; bitpos: [2]; default: 1;
 *  Query this field before using i2s rx function, after reset i2s module
 */
#define PCR_I2S_RX_READY    (BIT(2))
#define PCR_I2S_RX_READY_M  (PCR_I2S_RX_READY_V << PCR_I2S_RX_READY_S)
#define PCR_I2S_RX_READY_V  0x00000001U
#define PCR_I2S_RX_READY_S  2
/** PCR_I2S_TX_READY : RO; bitpos: [3]; default: 1;
 *  Query this field before using i2s tx function, after reset i2s module
 */
#define PCR_I2S_TX_READY    (BIT(3))
#define PCR_I2S_TX_READY_M  (PCR_I2S_TX_READY_V << PCR_I2S_TX_READY_S)
#define PCR_I2S_TX_READY_V  0x00000001U
#define PCR_I2S_TX_READY_S  3

/** PCR_I2S_TX_CLKM_CONF_REG register
 *  I2S_TX_CLKM configuration register
 */
#define PCR_I2S_TX_CLKM_CONF_REG (DR_REG_PCR_BASE + 0x78)
/** PCR_I2S_TX_CLKM_DIV_NUM : R/W; bitpos: [19:12]; default: 2;
 *  Integral I2S TX clock divider value. f_I2S_CLK = f_I2S_CLK_S/(N+b/a). There will be
 *  (a-b) * n-div and b * (n+1)-div.  So the average combination will be:  for b <=
 *  a/2, z * [x * n-div + (n+1)-div] + y * n-div. For b > a/2, z * [n-div + x *
 *  (n+1)-div] + y * (n+1)-div.
 */
#define PCR_I2S_TX_CLKM_DIV_NUM    0x000000FFU
#define PCR_I2S_TX_CLKM_DIV_NUM_M  (PCR_I2S_TX_CLKM_DIV_NUM_V << PCR_I2S_TX_CLKM_DIV_NUM_S)
#define PCR_I2S_TX_CLKM_DIV_NUM_V  0x000000FFU
#define PCR_I2S_TX_CLKM_DIV_NUM_S  12
/** PCR_I2S_TX_CLKM_SEL : R/W; bitpos: [21:20]; default: 0;
 *  Configures the clock source of I2S TX.
 *  0 (default): XTAL_CLK
 *  1: PLL_F240M_CLK
 *  2: PLL_F160M_CLK
 *  3: I2S_MCLK_in
 */
#define PCR_I2S_TX_CLKM_SEL    0x00000003U
#define PCR_I2S_TX_CLKM_SEL_M  (PCR_I2S_TX_CLKM_SEL_V << PCR_I2S_TX_CLKM_SEL_S)
#define PCR_I2S_TX_CLKM_SEL_V  0x00000003U
#define PCR_I2S_TX_CLKM_SEL_S  20
/** PCR_I2S_TX_CLKM_EN : R/W; bitpos: [22]; default: 0;
 *  Set 1 to enable i2s_tx function clock
 */
#define PCR_I2S_TX_CLKM_EN    (BIT(22))
#define PCR_I2S_TX_CLKM_EN_M  (PCR_I2S_TX_CLKM_EN_V << PCR_I2S_TX_CLKM_EN_S)
#define PCR_I2S_TX_CLKM_EN_V  0x00000001U
#define PCR_I2S_TX_CLKM_EN_S  22

/** PCR_I2S_TX_CLKM_DIV_CONF_REG register
 *  I2S_TX_CLKM_DIV configuration register
 */
#define PCR_I2S_TX_CLKM_DIV_CONF_REG (DR_REG_PCR_BASE + 0x7c)
/** PCR_I2S_TX_CLKM_DIV_Z : R/W; bitpos: [8:0]; default: 0;
 *  For b <= a/2, the value of I2S_TX_CLKM_DIV_Z is b. For b > a/2, the value of
 *  I2S_TX_CLKM_DIV_Z is (a-b).
 */
#define PCR_I2S_TX_CLKM_DIV_Z    0x000001FFU
#define PCR_I2S_TX_CLKM_DIV_Z_M  (PCR_I2S_TX_CLKM_DIV_Z_V << PCR_I2S_TX_CLKM_DIV_Z_S)
#define PCR_I2S_TX_CLKM_DIV_Z_V  0x000001FFU
#define PCR_I2S_TX_CLKM_DIV_Z_S  0
/** PCR_I2S_TX_CLKM_DIV_Y : R/W; bitpos: [17:9]; default: 1;
 *  For b <= a/2, the value of I2S_TX_CLKM_DIV_Y is (a%b) . For b > a/2, the value of
 *  I2S_TX_CLKM_DIV_Y is (a%(a-b)).
 */
#define PCR_I2S_TX_CLKM_DIV_Y    0x000001FFU
#define PCR_I2S_TX_CLKM_DIV_Y_M  (PCR_I2S_TX_CLKM_DIV_Y_V << PCR_I2S_TX_CLKM_DIV_Y_S)
#define PCR_I2S_TX_CLKM_DIV_Y_V  0x000001FFU
#define PCR_I2S_TX_CLKM_DIV_Y_S  9
/** PCR_I2S_TX_CLKM_DIV_X : R/W; bitpos: [26:18]; default: 0;
 *  For b <= a/2, the value of I2S_TX_CLKM_DIV_X is (a/b) - 1. For b > a/2, the value
 *  of I2S_TX_CLKM_DIV_X is (a/(a-b)) - 1.
 */
#define PCR_I2S_TX_CLKM_DIV_X    0x000001FFU
#define PCR_I2S_TX_CLKM_DIV_X_M  (PCR_I2S_TX_CLKM_DIV_X_V << PCR_I2S_TX_CLKM_DIV_X_S)
#define PCR_I2S_TX_CLKM_DIV_X_V  0x000001FFU
#define PCR_I2S_TX_CLKM_DIV_X_S  18
/** PCR_I2S_TX_CLKM_DIV_YN1 : R/W; bitpos: [27]; default: 0;
 *  For b <= a/2, the value of I2S_TX_CLKM_DIV_YN1 is 0 . For b > a/2, the value of
 *  I2S_TX_CLKM_DIV_YN1 is 1.
 */
#define PCR_I2S_TX_CLKM_DIV_YN1    (BIT(27))
#define PCR_I2S_TX_CLKM_DIV_YN1_M  (PCR_I2S_TX_CLKM_DIV_YN1_V << PCR_I2S_TX_CLKM_DIV_YN1_S)
#define PCR_I2S_TX_CLKM_DIV_YN1_V  0x00000001U
#define PCR_I2S_TX_CLKM_DIV_YN1_S  27

/** PCR_I2S_RX_CLKM_CONF_REG register
 *  I2S_RX_CLKM configuration register
 */
#define PCR_I2S_RX_CLKM_CONF_REG (DR_REG_PCR_BASE + 0x80)
/** PCR_I2S_RX_CLKM_DIV_NUM : R/W; bitpos: [19:12]; default: 2;
 *  Integral I2S clock divider value
 */
#define PCR_I2S_RX_CLKM_DIV_NUM    0x000000FFU
#define PCR_I2S_RX_CLKM_DIV_NUM_M  (PCR_I2S_RX_CLKM_DIV_NUM_V << PCR_I2S_RX_CLKM_DIV_NUM_S)
#define PCR_I2S_RX_CLKM_DIV_NUM_V  0x000000FFU
#define PCR_I2S_RX_CLKM_DIV_NUM_S  12
/** PCR_I2S_RX_CLKM_SEL : R/W; bitpos: [21:20]; default: 0;
 *  Configures the clock source of I2S RX.
 *  0 (default): XTAL_CLK
 *  1: PLL_F240M_CLK
 *  2: PLL_F160M_CLK
 *  3: I2S_MCLK_in
 */
#define PCR_I2S_RX_CLKM_SEL    0x00000003U
#define PCR_I2S_RX_CLKM_SEL_M  (PCR_I2S_RX_CLKM_SEL_V << PCR_I2S_RX_CLKM_SEL_S)
#define PCR_I2S_RX_CLKM_SEL_V  0x00000003U
#define PCR_I2S_RX_CLKM_SEL_S  20
/** PCR_I2S_RX_CLKM_EN : R/W; bitpos: [22]; default: 0;
 *  Set 1 to enable i2s_rx function clock
 */
#define PCR_I2S_RX_CLKM_EN    (BIT(22))
#define PCR_I2S_RX_CLKM_EN_M  (PCR_I2S_RX_CLKM_EN_V << PCR_I2S_RX_CLKM_EN_S)
#define PCR_I2S_RX_CLKM_EN_V  0x00000001U
#define PCR_I2S_RX_CLKM_EN_S  22
/** PCR_I2S_MCLK_SEL : R/W; bitpos: [23]; default: 0;
 *  Configures to select master clock.
 *  0 (default): I2S_TX_CLK
 *  1: I2S_RX_CLK
 */
#define PCR_I2S_MCLK_SEL    (BIT(23))
#define PCR_I2S_MCLK_SEL_M  (PCR_I2S_MCLK_SEL_V << PCR_I2S_MCLK_SEL_S)
#define PCR_I2S_MCLK_SEL_V  0x00000001U
#define PCR_I2S_MCLK_SEL_S  23

