espressif/esp-idf/components/soc/esp32c5/register/soc/pcr_reg.h
/** PCR_SAR_CLK_DIV_REG register
 *  SAR ADC clock divisor configuration register
 */
#define PCR_SAR_CLK_DIV_REG (DR_REG_PCR_BASE + 0x148)
/** PCR_SAR2_CLK_DIV_NUM : R/W; bitpos: [7:0]; default: 4;
 *  Configures the divisor for SAR ADC 2  clock to generate ADC analog control signals.
 */
#define PCR_SAR2_CLK_DIV_NUM    0x000000FFU
#define PCR_SAR2_CLK_DIV_NUM_M  (PCR_SAR2_CLK_DIV_NUM_V << PCR_SAR2_CLK_DIV_NUM_S)
#define PCR_SAR2_CLK_DIV_NUM_V  0x000000FFU
#define PCR_SAR2_CLK_DIV_NUM_S  0
/** PCR_SAR1_CLK_DIV_NUM : R/W; bitpos: [15:8]; default: 4;
 *  Configures the divisor for SAR ADC 1  clock to generate ADC analog control signals.
 */
#define PCR_SAR1_CLK_DIV_NUM    0x000000FFU
#define PCR_SAR1_CLK_DIV_NUM_M  (PCR_SAR1_CLK_DIV_NUM_V << PCR_SAR1_CLK_DIV_NUM_S)
#define PCR_SAR1_CLK_DIV_NUM_V  0x000000FFU
#define PCR_SAR1_CLK_DIV_NUM_S  8

/** PCR_BS_CONF_REG register
 *  BS configuration register
 */
#define PCR_BS_CONF_REG (DR_REG_PCR_BASE + 0x150)
/** PCR_BS_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable bs clock
 */
#define PCR_BS_CLK_EN    (BIT(0))
#define PCR_BS_CLK_EN_M  (PCR_BS_CLK_EN_V << PCR_BS_CLK_EN_S)
#define PCR_BS_CLK_EN_V  0x00000001U
#define PCR_BS_CLK_EN_S  0
/** PCR_BS_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset bs module
 */
#define PCR_BS_RST_EN    (BIT(1))
#define PCR_BS_RST_EN_M  (PCR_BS_RST_EN_V << PCR_BS_RST_EN_S)
#define PCR_BS_RST_EN_V  0x00000001U
#define PCR_BS_RST_EN_S  1

/** PCR_BS_FUNC_CONF_REG register
 *  BS_FUNC_CLK configuration register
 */
#define PCR_BS_FUNC_CONF_REG (DR_REG_PCR_BASE + 0x154)
/** PCR_BS_TX_RST_EN : R/W; bitpos: [23]; default: 0;
 *  Set 1 to reset bs tx module
 */
#define PCR_BS_TX_RST_EN    (BIT(23))
#define PCR_BS_TX_RST_EN_M  (PCR_BS_TX_RST_EN_V << PCR_BS_TX_RST_EN_S)
#define PCR_BS_TX_RST_EN_V  0x00000001U
#define PCR_BS_TX_RST_EN_S  23
/** PCR_BS_RX_RST_EN : R/W; bitpos: [24]; default: 0;
 *  Set 1 to reset bs rx module
 */
#define PCR_BS_RX_RST_EN    (BIT(24))
#define PCR_BS_RX_RST_EN_M  (PCR_BS_RX_RST_EN_V << PCR_BS_RX_RST_EN_S)
#define PCR_BS_RX_RST_EN_V  0x00000001U
#define PCR_BS_RX_RST_EN_S  24

/** PCR_BS_PD_CTRL_REG register
 *  BS power control register
 */
#define PCR_BS_PD_CTRL_REG (DR_REG_PCR_BASE + 0x158)
/** PCR_BS_MEM_FORCE_PU : R/W; bitpos: [1]; default: 0;
 *  Set this bit to force power up bs memory.
 */
#define PCR_BS_MEM_FORCE_PU    (BIT(1))
#define PCR_BS_MEM_FORCE_PU_M  (PCR_BS_MEM_FORCE_PU_V << PCR_BS_MEM_FORCE_PU_S)
#define PCR_BS_MEM_FORCE_PU_V  0x00000001U
#define PCR_BS_MEM_FORCE_PU_S  1
/** PCR_BS_MEM_FORCE_PD : R/W; bitpos: [2]; default: 1;
 *  Set this bit to force power down bs memory.
 */
#define PCR_BS_MEM_FORCE_PD    (BIT(2))
#define PCR_BS_MEM_FORCE_PD_M  (PCR_BS_MEM_FORCE_PD_V << PCR_BS_MEM_FORCE_PD_S)
#define PCR_BS_MEM_FORCE_PD_V  0x00000001U
#define PCR_BS_MEM_FORCE_PD_S  2

/** PCR_TIMERGROUP_WDT_CONF_REG register
 *  TIMERGROUP_WDT configuration register
 */
#define PCR_TIMERGROUP_WDT_CONF_REG (DR_REG_PCR_BASE + 0x15c)
/** PCR_TG0_WDT_RST_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to reset timer_group0 wdt module
 */
#define PCR_TG0_WDT_RST_EN    (BIT(0))
#define PCR_TG0_WDT_RST_EN_M  (PCR_TG0_WDT_RST_EN_V << PCR_TG0_WDT_RST_EN_S)
#define PCR_TG0_WDT_RST_EN_V  0x00000001U
#define PCR_TG0_WDT_RST_EN_S  0
/** PCR_TG1_WDT_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset timer_group1 wdt module
 */
#define PCR_TG1_WDT_RST_EN    (BIT(1))
#define PCR_TG1_WDT_RST_EN_M  (PCR_TG1_WDT_RST_EN_V << PCR_TG1_WDT_RST_EN_S)
#define PCR_TG1_WDT_RST_EN_V  0x00000001U
#define PCR_TG1_WDT_RST_EN_S  1

/** PCR_TIMERGROUP_XTAL_CONF_REG register
 *  TIMERGROUP1 configuration register
 */
#define PCR_TIMERGROUP_XTAL_CONF_REG (DR_REG_PCR_BASE + 0x160)
/** PCR_TG0_XTAL_RST_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to reset timer_group0 xtal clock domain
 */
#define PCR_TG0_XTAL_RST_EN    (BIT(0))
#define PCR_TG0_XTAL_RST_EN_M  (PCR_TG0_XTAL_RST_EN_V << PCR_TG0_XTAL_RST_EN_S)
#define PCR_TG0_XTAL_RST_EN_V  0x00000001U
#define PCR_TG0_XTAL_RST_EN_S  0
/** PCR_TG1_XTAL_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset timer_group1 xtal clock domain
 */
#define PCR_TG1_XTAL_RST_EN    (BIT(1))
#define PCR_TG1_XTAL_RST_EN_M  (PCR_TG1_XTAL_RST_EN_V << PCR_TG1_XTAL_RST_EN_S)
#define PCR_TG1_XTAL_RST_EN_V  0x00000001U
#define PCR_TG1_XTAL_RST_EN_S  1
/** PCR_TG0_XTAL_CLK_EN : R/W; bitpos: [2]; default: 1;
 *  Set 1 to enable tg0 xtal clock
 */
#define PCR_TG0_XTAL_CLK_EN    (BIT(2))
#define PCR_TG0_XTAL_CLK_EN_M  (PCR_TG0_XTAL_CLK_EN_V << PCR_TG0_XTAL_CLK_EN_S)
#define PCR_TG0_XTAL_CLK_EN_V  0x00000001U
#define PCR_TG0_XTAL_CLK_EN_S  2

/** PCR_KM_CONF_REG register
 *  Key Manager configuration register
 */
#define PCR_KM_CONF_REG (DR_REG_PCR_BASE + 0x164)
/** PCR_KM_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable km clock
 */
#define PCR_KM_CLK_EN    (BIT(0))
#define PCR_KM_CLK_EN_M  (PCR_KM_CLK_EN_V << PCR_KM_CLK_EN_S)
#define PCR_KM_CLK_EN_V  0x00000001U
#define PCR_KM_CLK_EN_S  0
/** PCR_KM_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset km module
 */
#define PCR_KM_RST_EN    (BIT(1))
#define PCR_KM_RST_EN_M  (PCR_KM_RST_EN_V << PCR_KM_RST_EN_S)
#define PCR_KM_RST_EN_V  0x00000001U
#define PCR_KM_RST_EN_S  1
/** PCR_KM_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset km module
 */
#define PCR_KM_READY    (BIT(2))
#define PCR_KM_READY_M  (PCR_KM_READY_V << PCR_KM_READY_S)
#define PCR_KM_READY_V  0x00000001U
#define PCR_KM_READY_S  2

/** PCR_KM_PD_CTRL_REG register
 *  Key Manager power control register
 */
#define PCR_KM_PD_CTRL_REG (DR_REG_PCR_BASE + 0x168)
/** PCR_KM_MEM_FORCE_PU : R/W; bitpos: [1]; default: 0;
 *  Set this bit to force power up KM memory.
 */
#define PCR_KM_MEM_FORCE_PU    (BIT(1))
#define PCR_KM_MEM_FORCE_PU_M  (PCR_KM_MEM_FORCE_PU_V << PCR_KM_MEM_FORCE_PU_S)
#define PCR_KM_MEM_FORCE_PU_V  0x00000001U
#define PCR_KM_MEM_FORCE_PU_S  1
/** PCR_KM_MEM_FORCE_PD : R/W; bitpos: [2]; default: 1;
 *  Set this bit to force power down KM memory.
 */
#define PCR_KM_MEM_FORCE_PD    (BIT(2))
#define PCR_KM_MEM_FORCE_PD_M  (PCR_KM_MEM_FORCE_PD_V << PCR_KM_MEM_FORCE_PD_S)
#define PCR_KM_MEM_FORCE_PD_V  0x00000001U
#define PCR_KM_MEM_FORCE_PD_S  2

/** PCR_TCM_MEM_MONITOR_CONF_REG register
 *  TCM_MEM_MONITOR configuration register
 */
#define PCR_TCM_MEM_MONITOR_CONF_REG (DR_REG_PCR_BASE + 0x16c)
/** PCR_TCM_MEM_MONITOR_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable tcm_mem_monitor clock
 */
#define PCR_TCM_MEM_MONITOR_CLK_EN    (BIT(0))
#define PCR_TCM_MEM_MONITOR_CLK_EN_M  (PCR_TCM_MEM_MONITOR_CLK_EN_V << PCR_TCM_MEM_MONITOR_CLK_EN_S)
#define PCR_TCM_MEM_MONITOR_CLK_EN_V  0x00000001U
#define PCR_TCM_MEM_MONITOR_CLK_EN_S  0
/** PCR_TCM_MEM_MONITOR_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset tcm_mem_monitor module
 */
#define PCR_TCM_MEM_MONITOR_RST_EN    (BIT(1))
#define PCR_TCM_MEM_MONITOR_RST_EN_M  (PCR_TCM_MEM_MONITOR_RST_EN_V << PCR_TCM_MEM_MONITOR_RST_EN_S)
#define PCR_TCM_MEM_MONITOR_RST_EN_V  0x00000001U
#define PCR_TCM_MEM_MONITOR_RST_EN_S  1
/** PCR_TCM_MEM_MONITOR_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset tcm_mem_monitor module
 */
#define PCR_TCM_MEM_MONITOR_READY    (BIT(2))
#define PCR_TCM_MEM_MONITOR_READY_M  (PCR_TCM_MEM_MONITOR_READY_V << PCR_TCM_MEM_MONITOR_READY_S)
#define PCR_TCM_MEM_MONITOR_READY_V  0x00000001U
#define PCR_TCM_MEM_MONITOR_READY_S  2

/** PCR_PSRAM_MEM_MONITOR_CONF_REG register
 *  PSRAM_MEM_MONITOR configuration register
 */
#define PCR_PSRAM_MEM_MONITOR_CONF_REG (DR_REG_PCR_BASE + 0x170)
/** PCR_PSRAM_MEM_MONITOR_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  Set 1 to enable psram_mem_monitor clock
 */
#define PCR_PSRAM_MEM_MONITOR_CLK_EN    (BIT(0))
#define PCR_PSRAM_MEM_MONITOR_CLK_EN_M  (PCR_PSRAM_MEM_MONITOR_CLK_EN_V << PCR_PSRAM_MEM_MONITOR_CLK_EN_S)
#define PCR_PSRAM_MEM_MONITOR_CLK_EN_V  0x00000001U
#define PCR_PSRAM_MEM_MONITOR_CLK_EN_S  0
/** PCR_PSRAM_MEM_MONITOR_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset psram_mem_monitor module
 */
#define PCR_PSRAM_MEM_MONITOR_RST_EN    (BIT(1))
#define PCR_PSRAM_MEM_MONITOR_RST_EN_M  (PCR_PSRAM_MEM_MONITOR_RST_EN_V << PCR_PSRAM_MEM_MONITOR_RST_EN_S)
#define PCR_PSRAM_MEM_MONITOR_RST_EN_V  0x00000001U
#define PCR_PSRAM_MEM_MONITOR_RST_EN_S  1
/** PCR_PSRAM_MEM_MONITOR_READY : RO; bitpos: [2]; default: 1;
 *  Query this field after reset psram_mem_monitor module
 */
#define PCR_PSRAM_MEM_MONITOR_READY    (BIT(2))
#define PCR_PSRAM_MEM_MONITOR_READY_M  (PCR_PSRAM_MEM_MONITOR_READY_V << PCR_PSRAM_MEM_MONITOR_READY_S)
#define PCR_PSRAM_MEM_MONITOR_READY_V  0x00000001U
#define PCR_PSRAM_MEM_MONITOR_READY_S  2

/** PCR_RESET_EVENT_BYPASS_REG register
 *  reset event bypass backdoor configuration register
 */
#define PCR_RESET_EVENT_BYPASS_REG (DR_REG_PCR_BASE + 0x174)
/** PCR_RESET_EVENT_BYPASS_APM : R/W; bitpos: [0]; default: 0;
 *  This field is used to control reset event relationship for
 *  tee_reg/apm_reg/hp_system_reg. 1: tee_reg/apm_reg/hp_system_reg will only be reset
 *  by power-reset. some reset event will be bypass. 0: tee_reg/apm_reg/hp_system_reg
 *  will not only be reset by power-reset, but also some reset event.
 */
#define PCR_RESET_EVENT_BYPASS_APM    (BIT(0))
#define PCR_RESET_EVENT_BYPASS_APM_M  (PCR_RESET_EVENT_BYPASS_APM_V << PCR_RESET_EVENT_BYPASS_APM_S)
#define PCR_RESET_EVENT_BYPASS_APM_V  0x00000001U
#define PCR_RESET_EVENT_BYPASS_APM_S  0
/** PCR_RESET_EVENT_BYPASS : R/W; bitpos: [1]; default: 1;
 *  This field is used to control reset event relationship for system-bus. 1: system
 *  bus (including arbiter/router) will only be reset by power-reset. some reset event
 *  will be bypass. 0: system bus (including arbiter/router) will not only be reset by
 *  power-reset, but also some reset event.
 */
#define PCR_RESET_EVENT_BYPASS    (BIT(1))
#define PCR_RESET_EVENT_BYPASS_M  (PCR_RESET_EVENT_BYPASS_V << PCR_RESET_EVENT_BYPASS_S)
#define PCR_RESET_EVENT_BYPASS_V  0x00000001U
#define PCR_RESET_EVENT_BYPASS_S  1

/** PCR_HPCORE_0_PD_CTRL_REG register
 *  HP CORE0 power control register
 */
#define PCR_HPCORE_0_PD_CTRL_REG (DR_REG_PCR_BASE + 0x178)
/** PCR_HPCORE_0_MEM_FORCE_PU : R/W; bitpos: [1]; default: 1;
 *  Set this bit to force power up HP CORE0 memory.
 */
#define PCR_HPCORE_0_MEM_FORCE_PU    (BIT(1))
#define PCR_HPCORE_0_MEM_FORCE_PU_M  (PCR_HPCORE_0_MEM_FORCE_PU_V << PCR_HPCORE_0_MEM_FORCE_PU_S)
#define PCR_HPCORE_0_MEM_FORCE_PU_V  0x00000001U
#define PCR_HPCORE_0_MEM_FORCE_PU_S  1
/** PCR_HPCORE_0_MEM_FORCE_PD : R/W; bitpos: [2]; default: 0;
 *  Set this bit to force power down HP CORE0 memory.
 */
#define PCR_HPCORE_0_MEM_FORCE_PD    (BIT(2))
#define PCR_HPCORE_0_MEM_FORCE_PD_M  (PCR_HPCORE_0_MEM_FORCE_PD_V << PCR_HPCORE_0_MEM_FORCE_PD_S)
#define PCR_HPCORE_0_MEM_FORCE_PD_V  0x00000001U
#define PCR_HPCORE_0_MEM_FORCE_PD_S  2

/** PCR_SDIO_SLAVE_CONF_REG register
 *  SDIO_SLAVE configuration register
 */
#define PCR_SDIO_SLAVE_CONF_REG (DR_REG_PCR_BASE + 0x17c)
/** PCR_SDIO_SLAVE_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set 1 to enable sdio_slave clock
 */
#define PCR_SDIO_SLAVE_CLK_EN    (BIT(0))
#define PCR_SDIO_SLAVE_CLK_EN_M  (PCR_SDIO_SLAVE_CLK_EN_V << PCR_SDIO_SLAVE_CLK_EN_S)
#define PCR_SDIO_SLAVE_CLK_EN_V  0x00000001U
#define PCR_SDIO_SLAVE_CLK_EN_S  0
/** PCR_SDIO_SLAVE_RST_EN : R/W; bitpos: [1]; default: 0;
 *  Set 1 to reset sdio_slave module
 */
#define PCR_SDIO_SLAVE_RST_EN    (BIT(1))
#define PCR_SDIO_SLAVE_RST_EN_M  (PCR_SDIO_SLAVE_RST_EN_V << PCR_SDIO_SLAVE_RST_EN_S)
#define PCR_SDIO_SLAVE_RST_EN_V  0x00000001U
#define PCR_SDIO_SLAVE_RST_EN_S  1

/** PCR_FPGA_DEBUG_REG register
 *  fpga debug register
 */
#define PCR_FPGA_DEBUG_REG (DR_REG_PCR_BASE + 0xff4)
/** PCR_FPGA_DEBUG : R/W; bitpos: [31:0]; default: 4294967295;
 *  Only used in fpga debug.
 */
#define PCR_FPGA_DEBUG    0xFFFFFFFFU
#define PCR_FPGA_DEBUG_M  (PCR_FPGA_DEBUG_V << PCR_FPGA_DEBUG_S)
#define PCR_FPGA_DEBUG_V  0xFFFFFFFFU
#define PCR_FPGA_DEBUG_S  0

/** PCR_CLOCK_GATE_REG register
 *  PCR clock gating configure register
 */
#define PCR_CLOCK_GATE_REG (DR_REG_PCR_BASE + 0xff8)
/** PCR_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Set this bit as 1 to force on clock gating.
 */
#define PCR_CLK_EN    (BIT(0))
#define PCR_CLK_EN_M  (PCR_CLK_EN_V << PCR_CLK_EN_S)
#define PCR_CLK_EN_V  0x00000001U
#define PCR_CLK_EN_S  0

/** PCR_DATE_REG register
 *  Date register.
 */
#define PCR_DATE_REG (DR_REG_PCR_BASE + 0xffc)
/** PCR_DATE : R/W; bitpos: [27:0]; default: 2363425;
 *  PCR version information.
 */
#define PCR_DATE    0x0FFFFFFFU
#define PCR_DATE_M  (PCR_DATE_V << PCR_DATE_S)
#define PCR_DATE_V  0x0FFFFFFFU
#define PCR_DATE_S  0

#ifdef __cplusplus
}
#endif
